12/data/attachments/a7b3d45c8c29c072.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Christina_pretty_Friend_32736_8</nif:username>
            <nif:friendToBeRequested>soap_friends_2f60d643-61c0-4ce1-9600-b776e76ef1cb</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>